In [55]:
##############
#K. David Roell CFPB 7/12/16
#expands data selection for quality edits to include context for developing statistical approaches
#will attemtp to segment mortgage market participants by loan activity by:
#volume/count of lending, income of applicants, securitization, property type and other factors
##############

import json
import os
import pandas as pd
import psycopg2
import matplotlib
import matplotlib.pyplot as plt
import matplotlib.patches as mpatches
get_ipython().magic(u'matplotlib inline')
matplotlib.style.use('ggplot')
#from macro_sql import Q076 
with open('quality_sql.json') as f: #FIXME change to quality_sql.json and refactor the rest of code
    edit_sql = json.load(f)
    
#parameter format for local use #consider changing hmdamaster to roellk if db changes cause a fail
params = {
'dbname':'hmdamaster',
'user':'roellk',
'password':'',
'host':'localhost',

}


try:
    conn = psycopg2.connect(**params)
    cur = conn.cursor()
    print("i'm connected")

except psycopg2.Error as e: #if database connection results in an error print the following
    print("I am unable to connect to the database: ", e)

i'm connected

In [59]:
def desc_stats_geo(table='hmdalar2014', field= 'amount', where_max=None, where_min=None, geo_level=None):
"""generates SQL statement to get descriptive statistics for a LAR field and group them by a geography if one is specified.
min and max can also be specified to focus analysis on a specific numeric range"""
    #FIXME change default values to none and implement value error
    #establish geo level for grouping
    if geo_level == 'MSA':
        geo_sql = 'msa,'
        geo_group = ',msa'
    elif geo_level == 'state':
        geo_sql = 'state,'
        geo_group = ',state'
    elif geo_level == 'county':
        geo_sql = 'CONCAT(state,county),'
        geo_group = ',CONCAT(state,county)'
    elif geo_level == 'tract':
        geo_sql = 'CONCAT(state,county,tract),'
        geo_group = ',CONCAT(state,county,tract)'
    else:
        geo_sql = ''
        geo_group = ''
        
    base_sql = """SELECT year, {geo_level} COUNT({field}) AS count_loans, SUM({field}::INT) AS sum_amt, AVG({field}::INT) AS avg_{field}, 
    STDDEV({field}::INT) AS std_{field}, MIN({field}::INT) AS min_{field}, 
    MAX({field}::INT) AS max_{field}""".format(field=field, geo_level=geo_sql)
    table_sql = "\nFROM {table}\n".format(table=table) 
    where_sql = "WHERE property_type = '1' AND loan_purpose = '1' AND agency != '7' AND {field} NOT ILIKE '%NA%' ".format(field=field)
    if where_max:
        where_sql = where_sql + " AND {field}::INT < ".format(field=field) + str(where_max)
    if where_min:
        where_sql = where_sql + " AND {field}::INT > ".format(field=field) + str(where_min)
    group_sql = """ GROUP BY year {geo_level}""".format(geo_level=geo_group)
    
    return_sql = base_sql + table_sql + where_sql + group_sql
    print(return_sql)
    return return_sql

In [64]:

#get descriptive statistics for the field named
#FIXME add an optional set of limits to look at sub distributions min/max= 10/600? set by cumulative probability
def get_desc_stats(geo_level=None, field='amount', year=2014, where_max=None, where_min=None):
    """"""
    #FIXME change default values to none and implement value error
    first = True
    while year > 2003: #loop over all years until schema change in LAR data
        table = 'hmdalar' + str(year) #set table name for query
        
        print(table)
        #cur.execute(desc_stats(table=table, field=field))        
        cur.execute(desc_stats_geo(table=table, field=field, where_max=where_max, where_min=where_min, geo_level=geo_level))        
        data_df = pd.DataFrame(cur.fetchall()) #convert query results to dataframe
        col_names = [desc[0] for desc in cur.description] #pull column names from cursor
        
        if len(data_df.columns) == len(col_names): #verify data was returned before naming columns
            print('setting column names')
            data_df.columns = col_names
        if first == True and len(data_df.columns) > 0: 
            dist_df = data_df.copy() #establish initial data frame
            first = False
        elif first == False and len(data_df.columns) > 0:
            print('merging dataframes')
            dist_df=dist_df.merge(data_df, how='outer') #merge subsequent data into initial data frame
        else:
            print('no data returned from query')
        
        #set upper and lower bounds on distribution
        dist_df['5_pct'] = dist_df['avg_{field}'.format(field=field)] - 2*dist_df['std_{field}'.format(field=field)]
        dist_df['95_pct'] = dist_df['avg_{field}'.format(field=field)] + 2*dist_df['std_{field}'.format(field=field)]
        
        print(dist_df.tail()) #print data to check results during execution
        
        path = 'dist_csvs/'
        if not os.path.exists(path):
            os.makedirs(path)
        year -= 1 #decrement year to select new table

    dist_df.to_csv(path + '{field}_desc_stats_{geo_level}.csv'.format(field=field, geo_level=geo_level),index=False)

get_desc_stats(geo_level='MSA', field='income')

hmdalar2014
SELECT year, msa, COUNT(income) AS count_loans, SUM(income::INT) AS sum_amt, AVG(income::INT) AS avg_income,
    STDDEV(income::INT) AS std_income, MIN(income::INT) AS min_income,
    MAX(income::INT) AS max_income
FROM hmdalar2014
WHERE property_type = '1' AND loan_purpose = '1' AND agency != '7' AND income NOT ILIKE '%NA%'  GROUP BY year ,msa
setting column names
   year    msa  count_loans  sum_amt            avg_income  \
0  2014  26380         1442   145621  100.9854368932038835
1  2014  28940         6914   715243  103.4485102690193810
2  2014  17900         8358   738529   88.3619286910744197
3  2014  17820         8901   818319   91.9356252106504887
4  2014  45220         3967   367467   92.6309553819006806

            std_income  min_income  max_income                  5_pct  \
0     212.825120831696           3        7020  -324.6648047701881165
1     193.953948078067           1        9600  -284.4593858871146190
2     110.232194895128           1        4356  -132.1024610991815803
3  84.7573801852694340           4        2500   -77.5791351598883793
4     142.503740711117           1        6888  -192.3765260403333194

                 95_pct
0  526.6356785565958835
1  491.3564064251533810
2  308.8263184813304197
3  261.4503855811893567
4  377.6384368041346806
hmdalar2013
SELECT year, msa, COUNT(income) AS count_loans, SUM(income::INT) AS sum_amt, AVG(income::INT) AS avg_income,
    STDDEV(income::INT) AS std_income, MIN(income::INT) AS min_income,
    MAX(income::INT) AS max_income
FROM hmdalar2013
WHERE property_type = '1' AND loan_purpose = '1' AND agency != '7' AND income NOT ILIKE '%NA%'  GROUP BY year ,msa
setting column names
merging dataframes
   year    msa  count_loans   sum_amt            avg_income  \
0  2014  26380       1442.0  145621.0  100.9854368932038835
1  2014  28940       6914.0  715243.0  103.4485102690193810
2  2014  17900       8358.0  738529.0   88.3619286910744197
3  2014  17820       8901.0  818319.0   91.9356252106504887
4  2014  45220       3967.0  367467.0   92.6309553819006806

            std_income  min_income  max_income                  5_pct  \
0     212.825120831696         3.0      7020.0  -324.6648047701881165
1     193.953948078067         1.0      9600.0  -284.4593858871146190
2     110.232194895128         1.0      4356.0  -132.1024610991815803
3  84.7573801852694340         4.0      2500.0   -77.5791351598883793
4     142.503740711117         1.0      6888.0  -192.3765260403333194

                 95_pct
0  526.6356785565958835
1  491.3564064251533810
2  308.8263184813304197
3  261.4503855811893567
4  377.6384368041346806
hmdalar2012
SELECT year, msa, COUNT(income) AS count_loans, SUM(income::INT) AS sum_amt, AVG(income::INT) AS avg_income,
    STDDEV(income::INT) AS std_income, MIN(income::INT) AS min_income,
    MAX(income::INT) AS max_income
FROM hmdalar2012
WHERE property_type = '1' AND loan_purpose = '1' AND agency != '7' AND income NOT ILIKE '%NA%'  GROUP BY year ,msa
setting column names
merging dataframes
   year    msa  count_loans   sum_amt            avg_income  \
0  2014  26380       1442.0  145621.0  100.9854368932038835
1  2014  28940       6914.0  715243.0  103.4485102690193810
2  2014  17900       8358.0  738529.0   88.3619286910744197
3  2014  17820       8901.0  818319.0   91.9356252106504887
4  2014  45220       3967.0  367467.0   92.6309553819006806

            std_income  min_income  max_income                  5_pct  \
0     212.825120831696         3.0      7020.0  -324.6648047701881165
1     193.953948078067         1.0      9600.0  -284.4593858871146190
2     110.232194895128         1.0      4356.0  -132.1024610991815803
3  84.7573801852694340         4.0      2500.0   -77.5791351598883793
4     142.503740711117         1.0      6888.0  -192.3765260403333194

                 95_pct
0  526.6356785565958835
1  491.3564064251533810
2  308.8263184813304197
3  261.4503855811893567
4  377.6384368041346806
hmdalar2011
SELECT year, msa, COUNT(income) AS count_loans, SUM(income::INT) AS sum_amt, AVG(income::INT) AS avg_income,
    STDDEV(income::INT) AS std_income, MIN(income::INT) AS min_income,
    MAX(income::INT) AS max_income
FROM hmdalar2011
WHERE property_type = '1' AND loan_purpose = '1' AND agency != '7' AND income NOT ILIKE '%NA%'  GROUP BY year ,msa
setting column names
merging dataframes
   year    msa  count_loans   sum_amt            avg_income  \
0  2014  26380       1442.0  145621.0  100.9854368932038835
1  2014  28940       6914.0  715243.0  103.4485102690193810
2  2014  17900       8358.0  738529.0   88.3619286910744197
3  2014  17820       8901.0  818319.0   91.9356252106504887
4  2014  45220       3967.0  367467.0   92.6309553819006806

            std_income  min_income  max_income                  5_pct  \
0     212.825120831696         3.0      7020.0  -324.6648047701881165
1     193.953948078067         1.0      9600.0  -284.4593858871146190
2     110.232194895128         1.0      4356.0  -132.1024610991815803
3  84.7573801852694340         4.0      2500.0   -77.5791351598883793
4     142.503740711117         1.0      6888.0  -192.3765260403333194

                 95_pct
0  526.6356785565958835
1  491.3564064251533810
2  308.8263184813304197
3  261.4503855811893567
4  377.6384368041346806
hmdalar2010
SELECT year, msa, COUNT(income) AS count_loans, SUM(income::INT) AS sum_amt, AVG(income::INT) AS avg_income,
    STDDEV(income::INT) AS std_income, MIN(income::INT) AS min_income,
    MAX(income::INT) AS max_income
FROM hmdalar2010
WHERE property_type = '1' AND loan_purpose = '1' AND agency != '7' AND income NOT ILIKE '%NA%'  GROUP BY year ,msa
setting column names
merging dataframes
   year    msa  count_loans   sum_amt            avg_income  \
0  2014  26380       1442.0  145621.0  100.9854368932038835
1  2014  28940       6914.0  715243.0  103.4485102690193810
2  2014  17900       8358.0  738529.0   88.3619286910744197
3  2014  17820       8901.0  818319.0   91.9356252106504887
4  2014  45220       3967.0  367467.0   92.6309553819006806

            std_income  min_income  max_income                  5_pct  \
0     212.825120831696         3.0      7020.0  -324.6648047701881165
1     193.953948078067         1.0      9600.0  -284.4593858871146190
2     110.232194895128         1.0      4356.0  -132.1024610991815803
3  84.7573801852694340         4.0      2500.0   -77.5791351598883793
4     142.503740711117         1.0      6888.0  -192.3765260403333194

                 95_pct
0  526.6356785565958835
1  491.3564064251533810
2  308.8263184813304197
3  261.4503855811893567
4  377.6384368041346806
hmdalar2009
SELECT year, msa, COUNT(income) AS count_loans, SUM(income::INT) AS sum_amt, AVG(income::INT) AS avg_income,
    STDDEV(income::INT) AS std_income, MIN(income::INT) AS min_income,
    MAX(income::INT) AS max_income
FROM hmdalar2009
WHERE property_type = '1' AND loan_purpose = '1' AND agency != '7' AND income NOT ILIKE '%NA%'  GROUP BY year ,msa
setting column names
merging dataframes
   year    msa  count_loans   sum_amt            avg_income  \
0  2014  26380       1442.0  145621.0  100.9854368932038835
1  2014  28940       6914.0  715243.0  103.4485102690193810
2  2014  17900       8358.0  738529.0   88.3619286910744197
3  2014  17820       8901.0  818319.0   91.9356252106504887
4  2014  45220       3967.0  367467.0   92.6309553819006806

            std_income  min_income  max_income                  5_pct  \
0     212.825120831696         3.0      7020.0  -324.6648047701881165
1     193.953948078067         1.0      9600.0  -284.4593858871146190
2     110.232194895128         1.0      4356.0  -132.1024610991815803
3  84.7573801852694340         4.0      2500.0   -77.5791351598883793
4     142.503740711117         1.0      6888.0  -192.3765260403333194

                 95_pct
0  526.6356785565958835
1  491.3564064251533810
2  308.8263184813304197
3  261.4503855811893567
4  377.6384368041346806
hmdalar2008
SELECT year, msa, COUNT(income) AS count_loans, SUM(income::INT) AS sum_amt, AVG(income::INT) AS avg_income,
    STDDEV(income::INT) AS std_income, MIN(income::INT) AS min_income,
    MAX(income::INT) AS max_income
FROM hmdalar2008
WHERE property_type = '1' AND loan_purpose = '1' AND agency != '7' AND income NOT ILIKE '%NA%'  GROUP BY year ,msa
setting column names
merging dataframes
   year    msa  count_loans   sum_amt            avg_income  \
0  2014  26380       1442.0  145621.0  100.9854368932038835
1  2014  28940       6914.0  715243.0  103.4485102690193810
2  2014  17900       8358.0  738529.0   88.3619286910744197
3  2014  17820       8901.0  818319.0   91.9356252106504887
4  2014  45220       3967.0  367467.0   92.6309553819006806

            std_income  min_income  max_income                  5_pct  \
0     212.825120831696         3.0      7020.0  -324.6648047701881165
1     193.953948078067         1.0      9600.0  -284.4593858871146190
2     110.232194895128         1.0      4356.0  -132.1024610991815803
3  84.7573801852694340         4.0      2500.0   -77.5791351598883793
4     142.503740711117         1.0      6888.0  -192.3765260403333194

                 95_pct
0  526.6356785565958835
1  491.3564064251533810
2  308.8263184813304197
3  261.4503855811893567
4  377.6384368041346806
hmdalar2007
SELECT year, msa, COUNT(income) AS count_loans, SUM(income::INT) AS sum_amt, AVG(income::INT) AS avg_income,
    STDDEV(income::INT) AS std_income, MIN(income::INT) AS min_income,
    MAX(income::INT) AS max_income
FROM hmdalar2007
WHERE property_type = '1' AND loan_purpose = '1' AND agency != '7' AND income NOT ILIKE '%NA%'  GROUP BY year ,msa
setting column names
merging dataframes
   year    msa  count_loans   sum_amt            avg_income  \
0  2014  26380       1442.0  145621.0  100.9854368932038835
1  2014  28940       6914.0  715243.0  103.4485102690193810
2  2014  17900       8358.0  738529.0   88.3619286910744197
3  2014  17820       8901.0  818319.0   91.9356252106504887
4  2014  45220       3967.0  367467.0   92.6309553819006806

            std_income  min_income  max_income                  5_pct  \
0     212.825120831696         3.0      7020.0  -324.6648047701881165
1     193.953948078067         1.0      9600.0  -284.4593858871146190
2     110.232194895128         1.0      4356.0  -132.1024610991815803
3  84.7573801852694340         4.0      2500.0   -77.5791351598883793
4     142.503740711117         1.0      6888.0  -192.3765260403333194

                 95_pct
0  526.6356785565958835
1  491.3564064251533810
2  308.8263184813304197
3  261.4503855811893567
4  377.6384368041346806
hmdalar2006
SELECT year, msa, COUNT(income) AS count_loans, SUM(income::INT) AS sum_amt, AVG(income::INT) AS avg_income,
    STDDEV(income::INT) AS std_income, MIN(income::INT) AS min_income,
    MAX(income::INT) AS max_income
FROM hmdalar2006
WHERE property_type = '1' AND loan_purpose = '1' AND agency != '7' AND income NOT ILIKE '%NA%'  GROUP BY year ,msa
setting column names
merging dataframes
   year    msa  count_loans   sum_amt            avg_income  \
0  2014  26380       1442.0  145621.0  100.9854368932038835
1  2014  28940       6914.0  715243.0  103.4485102690193810
2  2014  17900       8358.0  738529.0   88.3619286910744197
3  2014  17820       8901.0  818319.0   91.9356252106504887
4  2014  45220       3967.0  367467.0   92.6309553819006806

            std_income  min_income  max_income                  5_pct  \
0     212.825120831696         3.0      7020.0  -324.6648047701881165
1     193.953948078067         1.0      9600.0  -284.4593858871146190
2     110.232194895128         1.0      4356.0  -132.1024610991815803
3  84.7573801852694340         4.0      2500.0   -77.5791351598883793
4     142.503740711117         1.0      6888.0  -192.3765260403333194

                 95_pct
0  526.6356785565958835
1  491.3564064251533810
2  308.8263184813304197
3  261.4503855811893567
4  377.6384368041346806
hmdalar2005
SELECT year, msa, COUNT(income) AS count_loans, SUM(income::INT) AS sum_amt, AVG(income::INT) AS avg_income,
    STDDEV(income::INT) AS std_income, MIN(income::INT) AS min_income,
    MAX(income::INT) AS max_income
FROM hmdalar2005
WHERE property_type = '1' AND loan_purpose = '1' AND agency != '7' AND income NOT ILIKE '%NA%'  GROUP BY year ,msa
setting column names
merging dataframes
   year    msa  count_loans   sum_amt            avg_income  \
0  2014  26380       1442.0  145621.0  100.9854368932038835
1  2014  28940       6914.0  715243.0  103.4485102690193810
2  2014  17900       8358.0  738529.0   88.3619286910744197
3  2014  17820       8901.0  818319.0   91.9356252106504887
4  2014  45220       3967.0  367467.0   92.6309553819006806

            std_income  min_income  max_income                  5_pct  \
0     212.825120831696         3.0      7020.0  -324.6648047701881165
1     193.953948078067         1.0      9600.0  -284.4593858871146190
2     110.232194895128         1.0      4356.0  -132.1024610991815803
3  84.7573801852694340         4.0      2500.0   -77.5791351598883793
4     142.503740711117         1.0      6888.0  -192.3765260403333194

                 95_pct
0  526.6356785565958835
1  491.3564064251533810
2  308.8263184813304197
3  261.4503855811893567
4  377.6384368041346806
hmdalar2004
SELECT year, msa, COUNT(income) AS count_loans, SUM(income::INT) AS sum_amt, AVG(income::INT) AS avg_income,
    STDDEV(income::INT) AS std_income, MIN(income::INT) AS min_income,
    MAX(income::INT) AS max_income
FROM hmdalar2004
WHERE property_type = '1' AND loan_purpose = '1' AND agency != '7' AND income NOT ILIKE '%NA%'  GROUP BY year ,msa
setting column names
merging dataframes
   year    msa  count_loans   sum_amt            avg_income  \
0  2014  26380       1442.0  145621.0  100.9854368932038835
1  2014  28940       6914.0  715243.0  103.4485102690193810
2  2014  17900       8358.0  738529.0   88.3619286910744197
3  2014  17820       8901.0  818319.0   91.9356252106504887
4  2014  45220       3967.0  367467.0   92.6309553819006806

            std_income  min_income  max_income                  5_pct  \
0     212.825120831696         3.0      7020.0  -324.6648047701881165
1     193.953948078067         1.0      9600.0  -284.4593858871146190
2     110.232194895128         1.0      4356.0  -132.1024610991815803
3  84.7573801852694340         4.0      2500.0   -77.5791351598883793
4     142.503740711117         1.0      6888.0  -192.3765260403333194

                 95_pct
0  526.6356785565958835
1  491.3564064251533810
2  308.8263184813304197
3  261.4503855811893567
4  377.6384368041346806